tests/performance/full_journey.yml
config:
  target: "http://localhost:4000/api"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Single User Journey Test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Full Nutritionist Workflow"
    flow:
      # 1. Register Nutritionist
      - log: "Step 1: Registering new Nutritionist..."
      - post:
          url: "/auth/register/nutritionist"
          json:
            email: "nutri_{{ $randomString() }}@test.com"
            password: "Password123!"
            firstName: "Nutri"
            lastName: "Test"
          capture:
            - json: "$.data.user.email"
              as: "registeredEmail"
            - json: "$.data.token"
              as: "token" 
              # We get token on register too? If so, we can skip login, but let's test login.
      
      - log: "Registered Email: {{ registeredEmail }}"

      # 2. Login
      - log: "Step 2: Authenticating..."
      - post:
          url: "/auth/login"
          json:
            email: "{{ registeredEmail }}"
            password: "Password123!"
          capture:
            - json: "$.data.token"
              as: "token"
            - json: "$.data.user.id"
              as: "nutritionistId"

      # 3. Register Patient
      - log: "Step 3: Registering new patient..."
      - post:
          url: "/patients/register-by-nutritionist"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            email: "patient_{{ $randomString() }}@test.com"
            password: "Password123!"
            first_name: "TestUser"
            last_name: "LoadTest"
            birth_date: "1990-01-01"
            gender: "male"
            age: 30
          capture:
            - json: "$.data.patient.id"
              as: "patientId"
      
      - log: "Patient created with ID: {{ patientId }}"

      # 4. Create Clinical Record
      - log: "Step 4: Creating Clinical Record..."
      - post:
          url: "/clinical-records"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            patientId: "{{ patientId }}"
            recordDate: "2024-01-01"
            consultationReason: "Routine Checkup Load Test"
            currentProblems:
              observations: "Generated by Load Test"
            biochemicalIndicators:
              glucose: 90
              cholesterol: 180

      # 5. Create Diet Plan
      - log: "Step 5: Creating Diet Plan..."
      - post:
          url: "/diet-plans"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            name: "Load Test Diet Plan"
            patientId: "{{ patientId }}"
            startDate: "2024-01-02"
            endDate: "2024-02-02"
            dailyCaloriesTarget: 2000
            description: "Generated by Artillery"
            meals: []

      # 6. Verify Patient Data (Read)
      - log: "Step 6: Verifying Patient Data..."
      - get:
          url: "/patients/{{ patientId }}"
          headers:
            Authorization: "Bearer {{ token }}"